
#include <stdint.h>
#include <stm32f4xx.h>

#include "engine.h"


/*
------------ функция запуска/остановки двигателя ---------
если надо запустить
	если статус двигателя	ОСТАНОВЛЕН 
		статус - ЗАПУСК
		выйти
	если статус двигателя	ОХЛАЖДЕНИЕ
		если время работы больше 4 часа и поднят флаг "работа с перерывами"
			- выйти
			
		- сброс переменной "время охлаждения"
		- статус - ЗАПУЩЕН
		- выйти

если надо заглушить
	если статус двигателя	ЗАПУСК
		- выкл. стартер
		- выкл. подсос
		- сбросить счетчик кручения стартером
		- сбросить счетчик попыток последнего запуска
		- записать время в переменную "начала остановки"
		- статус - ОСТАНОВКА
		- выйти
		
	если статус двигателя	ПРОГРЕВ
		- сбросить переменную "время прогрева"
		- записать время в переменную "начала остановки"
		- статус - ОСТАНОВКА
		- выйти
		
	если статус двигателя	ЗАПУЩЕН
		- статус - ОХЛАЖДЕНИЕ
		- выйти
*/		
//??? доделать
uint8_t startStopEngine(uint32_t status)
{
	// если надо запустить
	if(status == SET)
	{
	
	}
	
	
	
	return 1;
}

	
/*	
------------- АЛГОРИТМ РАБОТЫ ДВИГАТЕЛЯ ------------
если ручной режим
	если включено реле стартера более положеного
		отключить реле


если статус двигателя	ОСТАНОВЛЕН 
	- выйти	
если статус двигателя	ЗАПУСК
	- если двигатель в ошибке
		- выйти
	- если ичерпано кол-во попыток запуска
			- обнулить переменную попыток последнего запуска
			- статус двигателя - ОСТАНОВЛЕН
			- выкл. зажигание
			- двигатель в ошибку
			- выйти
	- если не крутит стартером 
		- если выключено зажигание 
			- включить(сделать отдельную функцию) 
			- пауза 200мс
			- проверка включения реле
				если не включилось 
					- ошибка
					- выключить
					- статус - ОСТАНОВЛЕН
					- выйти
		- если необходимо вкл подсос и не включен
			- включить, пауза 3мс
		- засечь время начала работы стартера
		- включить стартер
		- выйти
	- если крутит стартером 
		- если завелся
			- выкл. стартер
			- выкл. подсос
			- сбросить счетчик кручения стартером
			- сбросить счетчик попыток последнего запуска
			- инкрементировать удачную попытку запуска
			- инкрементировать попытку запуска всего
			- засечь время прогрева
			- засечь время работы
			- статус - ПРОГРЕВ
			- выйти
		- если крутит больше чем надо
			- выкл. стартер
			- выкл. подсос
			- выкл. зажигание
			- сбросить счетчик кручения стартером
			- засечь время начала отдыха стартера
			- инкрементировать попытку последнего запуска
			- инкрементировать попытку запуска всего
			- если ичерпано кол-во попыток запуска
				- статус двигателя - остановлен
				- обнулить переменную попыток последнего запуска
				- двигатель в ошибку
				- статус - ОСТАНОВЛЕН
				- выйти
			- статус - ОТДЫХ СТАРТЕРА
			- выйти
			
если статус двигателя	ОТДЫХ СТАРТЕРА	
	если прошло 3с
		- сбросить переменную перерыва
		- статус ЗАПУСК
		- выйти

если статус двигателя	ПРОГРЕВ
	если двигатель заглох!!!!!!!!!!!!!!!!
		- сбросить переменную "время прогрева"
			- двигатель в ошибку
			- приплюсовать моточасы после ТО
			- минусовать моточасы до ТО
			- приплюсовать моточасы всего
			- обнулить переменную времени работы
			- статус - ОСТАНОВЛЕН
			- выйти
		
	если прогревается 3 мин
		- сбросить переменную "время прогрева"
		- статус - ЗАПУЩЕН
		- выйти

если статус двигателя	ЗАПУЩЕН
	если двигатель заглох!!!!!!!!!!!!!!!!
		- сбросить переменную "время прогрева"
			- двигатель в ошибку
			- приплюсовать моточасы после ТО
			- минусовать моточасы до ТО
			- приплюсовать моточасы всего
			- обнулить переменную времени работы
			- статус - ОСТАНОВЛЕН
			- выйти
			
	если работает больше 4 часов
		если можно делать перерывы
			- сброс переменной "время охлаждения"
			- статус - ОХЛАЖДЕНИЕ
			- если нет внешнего питания - силовой рубильник в 0
			- выйти

		если нельзя делать перерывы
			- ворнинг - необходим отдых ДВС
			- выйти

если статус двигателя	ОХЛАЖДЕНИЕ
	если двигатель заглох!!!!!!!!!!!!!!!!
		- сбросить переменную "время прогрева"
			- двигатель в ошибку
			- приплюсовать моточасы после ТО
			- минусовать моточасы до ТО
			- приплюсовать моточасы всего
			- обнулить переменную времени работы
			- статус - ОСТАНОВЛЕН
			- выйти
			
	если охлаждается больше 3мин
		- сброс переменной "время охлаждения"
		- выкл. зажигание
		- статус ОСТАНОВКА
		- записать время в переменную "начала остановки"
		- выйти

если статус двигателя	ОСТАНОВКА	
	если останавливается больше 10 секунд
		- выкл. зажигание
		- статус - ОСТАНОВЛЕН
		- двигатель в ошибку
		- сбросить переменную "начала остановки"
		- приплюсовать моточасы после ТО
		- минусовать моточасы до ТО
		- приплюсовать моточасы всего
		- обнулить переменную времени работы
		- выйти
	если остановился
		- сбросить переменную "начала остановки"
		- статус - ОСТАНОВЛЕН
		- приплюсовать моточасы после ТО
		- минусовать моточасы до ТО
		- приплюсовать моточасы всего
		- обнулить переменную времени работы
			если время работы больше 4 часа и поднят флаг "работа с перерывами"
				- засечь переменную "начала перерыва"
				- статус - ПЕРЕРЫВ
		- выйти
		
если статус двигателя	ПЕРЕРЫВ		
		если перерыв больше 30 мин
			- сброс переменной "начала перерыва"
			- статус - ОСТАНОВЛЕН
			- выйти
*/			
void engineWork(void)
{


}

